12/data/attachments/b19f44fba2d1da00.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cd858865-2cf8-4dd2-bca7-fd02ca950a17</nif:username>
            <nif:friendToBeAdded>Daniel_peace_Friend_2666_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>